# Reading and Writing Data in Text Format

In [1]:
import pandas as pd
import numpy as np

In [3]:
!type example/ex1.csv

The syntax of the command is incorrect.

In [4]:
df = pd.read_csv('examples/ex1.csv')

In [5]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv('examples/ex2.csv', names=['a','b','c','d',',message'])

   a   b   c   d ,message
0  1   2   3   4    hello
1  5   6   7   8    world
2  9  10  11  12      foo

In [8]:
names=['a','b','c','d','message']
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])

In [10]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [11]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [12]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

In [13]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [14]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
result = pd.read_csv('examples/ex5.csv')

In [16]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [17]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [18]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [19]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [20]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [21]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

## Reading Text Files in Pieces

In [22]:
pd.options.display.max_rows = 10

In [23]:
result = pd.read_csv('examples/ex6.csv')

In [24]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [25]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [26]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [27]:
chunker

In [28]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [29]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

C:\Users\asaad\AppData\Local\Temp\ipykernel_5532\1063731973.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

In [30]:
tot[:10]

0    151.0
1    146.0
2    152.0
3    162.0
4    171.0
5    157.0
6    166.0
7    164.0
8    162.0
9    150.0
dtype: float64

In [31]:
tot = pd.Series([])
[tot.add(piece['key'].value_counts(), fill_value=0) for piece in chunker]

C:\Users\asaad\AppData\Local\Temp\ipykernel_5532\232947126.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = pd.Series([])

[]

## Writing Data to Text Format

In [32]:
data = pd.read_csv('examples/ex5.csv')

In [33]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [34]:
data.to_csv('examples/out.csv')

In [35]:
!type examples/out.csv

The syntax of the command is incorrect.

In [36]:
import sys

In [37]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [38]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [39]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [40]:
data.to_csv(sys.stdout, index=False, columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [41]:
dates = pd.date_range('1/1/2000', periods=7)

In [42]:
ts = pd.Series(np.arange(7), index=dates)

In [43]:
ts.to_csv('examples/tseries.csv')

## Working with Delimited Formats

In [44]:
!type examples/ex7.csv

The syntax of the command is incorrect.

In [45]:
import csv
f = open('examples/ex7.csv')
reader = csv.reader(f)

In [46]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [47]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [48]:
header, values = lines[0], lines[1:]

In [49]:
header

['a', 'b', 'c']

In [50]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [51]:
data_dict = {h: v for h,v in zip(header, zip(*values))}

In [52]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [53]:
f = open('examples/ex7.csv')

In [54]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

reader = csv.reader(f, dialect=my_dialect)

In [55]:
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [56]:
f = open('examples/ex7.csv')

In [57]:
reader = csv.reader(f, delimiter='|')

In [58]:
for line in reader:
    print(line)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

In [59]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

## JSON Data

In [60]:
obj = """
{"name": "Wes",
"places_lived": ["US", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
            {"name": "Katie", "age": 38,
            "pets": ["Sixes", "Stache", "Cisco"]}]

}
"""

In [61]:
import json

In [62]:
result = json.loads(obj)

In [63]:
result

{'name': 'Wes',
 'places_lived': ['US', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [64]:
asjson = json.dumps(result)

In [65]:
asjson

'{"name": "Wes", "places_lived": ["US", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [66]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [67]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [68]:
data = pd.read_json('examples/example.json')

In [69]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [70]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [71]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

## XML and HTML: Web Scraping

In [72]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [73]:
len(tables)

1

In [74]:
failures = tables[0]

In [75]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [76]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [77]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

### Parsing XML with lxml.objectify

In [78]:
from lxml import objectify

In [79]:
path = 'datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [80]:
data = []

In [81]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

In [82]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [83]:
perf = pd.DataFrame(data)

In [84]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [85]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [86]:
root

In [87]:
root.get('href')

'http://www.google.com'

In [88]:
root.text

'Google'

# Binary Data Formats

In [89]:
frame = pd.read_csv('examples/ex1.csv')

In [90]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [91]:
frame.to_pickle('examples/frame_pickle')

In [92]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [93]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [94]:
store = pd.HDFStore('mydata.h5')

In [96]:
store['obj1'] = frame

In [97]:
store['obj1_col'] = frame['a']

In [98]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [100]:
store['obj1']

           a
0  -1.095436
1   0.462540
2   1.183619
3   0.414429
4  -1.142767
..       ...
95  0.705982
96 -0.575773
97 -1.183469
98  0.748617
99  0.730100

[100 rows x 1 columns]

In [102]:
store['obj1_col']

0    -1.095436
1     0.462540
2     1.183619
3     0.414429
4    -1.142767
        ...
95    0.705982
96   -0.575773
97   -1.183469
98    0.748617
99    0.730100
Name: a, Length: 100, dtype: float64

In [103]:
store.put('obj2', frame, format='table')

In [104]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.847030
11 -0.302124
12  0.550790
13 -0.790526
14 -0.041460
15  1.050874

In [105]:
store.close()

In [106]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [107]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -1.095436
1  0.462540
2  1.183619
3  0.414429
4 -1.142767

## Reading Microsoft Excel Files

In [2]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [3]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [4]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [5]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [6]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [7]:
frame.to_excel(writer, 'Sheet1')

In [8]:
writer.save()

In [9]:
frame.to_excel('examples/ex2.xlsx')

# Interacting with Web APIs

In [2]:
import requests

In [3]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [4]:
resp = requests.get(url)

ConnectionError: HTTPSConnectionPool(host='api.github.com', port=443): Max retries exceeded with url: /repos/pandas-dev/pandas/issues (Caused by NewConnectionError('<urllib3.connection.HTTPSConnection object at 0x0000028C5A05A140>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed'))

In [ ]:
resp

In [ ]:
data = resp.json()

In [ ]:
data[0]['title']

In [ ]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                    'labels', 'state'])

In [ ]:
issues

# Interacting with Databases

In [12]:
import sqlite3

In [13]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER
);
"""

In [14]:
con = sqlite3.connect('mydata.sqlite')

In [15]:
con.execute(query)

OperationalError: table test already exists

In [16]:
con.commit()

In [17]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [18]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [19]:
con.executemany(stmt, data)

In [20]:
con.commit()

In [21]:
cursor = con.execute('select * from test')

In [22]:
rows = cursor.fetchall()

In [23]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5),
 ('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [24]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [25]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5

In [26]:
[x[0] for x in cursor.description]

['a', 'b', 'c', 'd']

In [27]:
import sqlalchemy as sqla

In [28]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [29]:
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5
3      Atlanta     Georgia  1.25  6
4  Tallahassee     Florida  2.60  3
5   Sacramento  California  1.70  5